["Campaign Finance Statement - 11TH WARD DEM COMM - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - 14TH WARD DEMOCRATIC COMMITTEE - N/A - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - 14TH WARD DEMOCRATIC COMMITTEE - N/A - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ABEL, KATE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ACLU - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ACLU - N/A - 24 HOUR REPORT - 2023","Campaign Finance Statement - ALARCON, MARK - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ALEXANDROFF NICHOLAS - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ALLIES FOR DEVON TALIAFERRO - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - AMANDA LECKMAN DEPAULIS - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ANDREW FLYNN - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ANGELA B PETERSEN - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - APPEL, JOSEPH C. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ATKINS, LINDA A. - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - AVON, LIZ - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BACON, IAN CLARKE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BALDWIN BOROUGH DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BALDWIN BOROUGH DEM COMM - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BARB WARWICK - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BARB WARWICK FOR CITY COUNCIL DISTRICT 5 - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BARB WARWICK FOR CITY COUNCIL DISTRICT 5 - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - BARB WARWICK FOR CITY COUNCIL DISTRICT 5 - MEMBER OF COUNCIL - 24 HOR REPORT - 2023","Campaign Finance Statement - BARBARA L BOLAS - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BARKER, DWAYNE - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BARKER, DWAYNE FRIENDS OF FOR PPS - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BELLEVUE DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BEN AVON DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BENGEL CAROLYN - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BENGEL, COMMITTEE TO RE-ELECT JUDGE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BENGEL, ERIC - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BERDYCK, MELINDA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BESWICK, LOUISE - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BETHEL PARK REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BETHEL PARK REP COMM - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BETTER SF - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BEUSE, JENNIFER - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BILL CROSS - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BILLY FOR PITTSBURGH - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BLACK WOMEN FOR A BETTER EDU - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BOB GIBBS FOR NA SCHOOLS - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BONAROTI FOR PA - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BONAROTI FOR PA - MEMBER OF COUNTY COUNCIL - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BONAROTI, DAVID - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BONI BRUCE J. FOR DJ - MAGISTERIAL DISTRICT JUDGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - BONNER, SYLVANA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BOTTA, JORDAN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BOTTA, JORDAN FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BOTTA, MELISSA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BOYLE, DAVE - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BP 4 ALL - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRADDOCK HILLS DEM PRIM ELECTION COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRAKE-ZACHERL, JEREMY - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRANDT, JOHN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRIAN SAMUEL MALKIN - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRIAN SNYDER - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRILLMAN FOR CITY COUNCIL - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRILLMAN, LAURA - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BROSKY, EDWARD G. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BROWN, DAVID C. - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRUCE J. BONI - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRUCE J. BONI FOR DISTRICT JUDGE - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRUNGO, MATT FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRUNGO, MATTHEW J. - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BRUSSELARS, ERICA FOR TREASURER - TREASURER - 24 HOUR REPORT - 2023","Campaign Finance Statement - BRUSSELARS, ERICA ROCCHI - COUNTY TREASURER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BUTLER DAN - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - BUTLER, DAN COMMITTEE TO RE-ELECT JUDGE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CACIANI, MARC D. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CALABRESE, PAULINE - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CALABRESE, PAULINE COMMITTEE TO ELECT - MAYOR - 24 HOUR REPORT - 2023","Campaign Finance Statement - CALABRESE, PAULINE COMMITTEE TO ELECT - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CAMPBELL, PATRICK D. - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CAMPBELL, PATRICK D. COMMITTEE TO ELECT - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CARDILLO, LARRY FRIENDS OF - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CARDILLO, LAWRENCE - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CARRELL, KATHLEEN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CAULFIELD, LISA - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CAULFIELD, LISA FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CAULFIELD, LISA FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - CHAPARRO, JENNIFER K. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHARLAND, BOB - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHARLAND, BOB FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - CHARLAND, BOB FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHARLAND, BOB FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - CHENG, YULING - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHEREPKO, MIKE - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHEREPKO, MIKE FRIENDS OF - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHIRDON, CHRIS - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHRIS RIEGER - MEMBER OF COUNTY COUNCIL - 7 - ANNUAL - 2023","Campaign Finance Statement - CHRIS RIEGER - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CHRISTENSON, BARRY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CITY OF PITTSBURGH REPUBLICAN COMMITTEE - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CLOONAN FOR MCCANDLESS - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CLOONAN, PATRICIA ANN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CODELKA, ANDREW J. - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COGHILL ANTHONY - COUNTY TREASURER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COGHILL, ANTHONY FRIENDS OF - COUNTY TREASURER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COLAIZZI THERESA - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COLLIER REP COMM - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COLLIER REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COLOMBO, RYAN FRIENDS OF - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COMENSKY, BURTON - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COMMITTEE FOR PENN HILLS PUBLIC EDUCATION - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COMMITTEE TO ELECT BP FORWARD - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - COMMITTEE TO ELECT DERUBEIS, BOYCE &amp; ELLIOTT - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CRABLE, BRENNA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CRANE, SEAN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CRONICAN, ANDY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CRYSTAL BARR - SCHOOL DIRECTOR - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - CRYSTAL BARR - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DAVID BARKOVICH - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DAVID BARKOVICH - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DAVID BENTZ - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DAVID W. SHUTTER - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DAVIDSON, CHRISTOPHER - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEMARCO, DAN FRIENDS OF - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEMARCO, DANIEL L. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEMOCRATIC COMMITTEE OF CHURCHILL BOROUGH - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEPASQUALE FOR CITY CONTROLLER - CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEPASQUALE, MARK V. - CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DERUBEIS, MARK - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEVINE, MIKE FRIENDS OF - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEVINE, MIKE FRIENDS OF - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DEVON TALIAFERRO - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DITULLIO, GREGORY J. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DIVA MARES - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DIVA MARES - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DODDATO, BOB - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DONAHUE, TAMARA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DORMONT WOMEN FOR PROGRESS - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DOUGLAS ARLOW - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DOVEN FOR PA - MEMBER OF COUNTY COUNCIL AT-LARGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - DOVEN FOR PA - MEMBER OF COUNTY COUNCIL AT-LARGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - DOVEN FOR PA - MEMBER OF COUNTY COUNCIL AT-LARGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - DOVEN FOR PA - MEMBER OF COUNCIL AT-LARGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - DOVEN FOR PA - MEMBER OF COUNTY COUNCIL AT-LARGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DOWNER, SUZANNE M. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DOYLE, MIKE PAC - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DRURY, KATE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUBRELL, SEBASTIEN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUERR, THOMAS MATTHEW - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUERR, THOMAS MATTHEW - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUERR, TOM FRIENDS OF - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUERR, TOM FRIENDS OF - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUGAN, MATT - DISTRICT ATTORNEY - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUGAN, MATT FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - DUGAN, MATT FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - DUGAN, MATT FRIENDS OF - DISTRICT ATTORNEY - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - DUGAN, MATT FRIENDS OF - DISTRICT ATTORNEY - 24 HOR REPORT - 2023","Campaign Finance Statement - EISENREICH MARY ANN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ELIJAH MAJOCHA - SCHOOL DIRECTOR - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ELLIOTT, JOSH - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - EMBRESCIA, MICHAEL - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - EMBRESCIA, MIKE FRIENDS OF - MEMBER OF COUNTY COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - EMBRESCIA, MIKE FRIENDS OF - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - EMBRESCIA, MIKE FRIENDS OF - MEMBER OF COUNTY COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - EMBRESCIA, MIKE FRIENDS OF - MEMBER OF COUNTY COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - EMERGING LEADERS - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ERICA FOR TREASURER - COUNTY TREASURER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ERICA FOR TREASURER - COUNTY TREASURER - 24 HOUR REPORT - 2023","Campaign Finance Statement - ERIN SCHUETZ - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - EVANS CHRISTOPHER J. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - EVANS, IREN - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - EVANS, IREN FOR MDJ - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FAMILIES FOR MOON SCHOOLS - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FAWCETT, DAVE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FAWCETT, DAVID B. - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FELDMEIER, MATT FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FILIAGGI, SUZANNE M. - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FISCHER, ERIC - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FISCHER, ERIC COMMITTEE TO ELECT - MAGISTERIAL DISTRICT JUDGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FISCHER, ERIC COMMITTEE TO ELECT - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FISCHER, ERIC COMMITTEE TO ELECT - MAGISTERIAL DISTRICT JUDGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - FITZGERALD RICH FRIENDS OF - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FLEISHER, VALERIE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FORD, GLENN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FORTIER, ASHLEY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRANK, RONALD P. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF ANDREW FLYNN - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF BILL CROSS - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF CASEY MULLEN - MAGISTERIAL DISTRICT JUDGE - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF CASEY MULLEN - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF CHRIS RIEGER - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF DAN GRZYBEK - MEMBER OF COUNTY COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF DARWIN - COUNTY CONTROLLER - 24 HOUR REPORT - 2023","Campaign Finance Statement - FRIENDS OF DARWIN - COUNTY CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF DAVID BARKOVICH - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF EMMA YOURD - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF GREG DOLAN - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF JAIME MARTINEZ - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF MASB CANDIDATES - N/A - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF MASB CANDIDATES - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF NA EDUCATION - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF PAM HARBIN - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF RIVERVIEW EDUCATION - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF RON SOFO - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF RON SOFO - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF RYAN SCHNEIDERLOCHNER - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF RYAN SCHNEIDERLOCHNER - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF SAM DEMARCO - MEMBER OF COUNTY COUNCIL AT-LARGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF SAMANTHA ELLWOOD - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF SUZANNE - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FRIENDS OF VIOLA GARIS - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FULLER, CHERYLIE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FUTULES, NICHOLAS COMM TO ELECT - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - FUTULES, NICHOLAS W. - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GAINEY FOR MAYOR - MAYOR - 30 DAY POST-SPECIAL ELECTION - 2023","Campaign Finance Statement - GAINEY FOR MAYOR - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GARVEY, THOMAS R. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GELMAN, EVA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GENE WITT - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GEORGE C. PAMBACAS - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GIBBS,BOB - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GILL, ADAM C. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GILMAN, DAN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GILMAN, DAN FRIENDS - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GIRARDI, MICHAEL FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GIRARDI, MICHAEL J. - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GOSNELL, DANIELLE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GRAVER, DAVID - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GROSS, DEB FRIENDS - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GRZYBEK, DAN - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - GUARINO, SAMUEL N. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HALLAM, BETHANY - MEMBER OF COUNTY COUNCIL AT-LARGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HALLAM, BETHANY FRIENDS OF - MEMBER OF COUNTY COUNCIL AT-LARGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HALLIE H SNYDER - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HAMER, TODD - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HAMPTON DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HAMPTON REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HANLEY JR. JAMES J. - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HANLEY JR. JAMES J. - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HARKLEROAD, JUSTIN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HARRIS, KHADIJAH - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HAWES, ANGELA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HAYNES-JOHNSON, RENEE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HEISLER, RACHAEL - CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HOFFMAN, TODD - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HONDRU, MARK - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HRVATIN, CASANDRA - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - HUEHN, LOUISE F. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - INDIANA REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - INNAMORATO, SARA - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - INNAMORATO, SARA FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - ISABELLE MCDADE - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JACOBS-ROHAN, LEANNE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JANET REDWING SIDOR - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JASON GRAVES - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JEFFERSON HILLS DEMOCRATIC COMMITTEE - N/A - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JEFFERSON HILLS REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JEFFREY ZURISKO - MAGISTERIAL DISTRICT JUDGE - 5 - 2ND FRIDAY PRE-ELECTION - 2023","Campaign Finance Statement - JOHN BELL - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JOHN BELL - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JONES, CHARDAE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JOSEPH LYNCH - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JOSEPH WALL - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - JUSTIN D LAMBER - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KARAICA, MITCHELL - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KARAICA, MITCHELL THE COMMITTEE TO ELECT - MAGISTERIAL DISTRICT JUDGE - 30 DAY POST-PRIMARY - 2023","Campaign Finance Statement - KATE MATZ - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KEHM, JACQUET - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KELLAR, EDDIE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KELLY PARKER HANNA - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KENNEDY DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KENNEDY REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KERIN, KEVIN - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KEVIN POLICK - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KING RICHARD - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KING RICHARD COMM - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KING, RICHARD COMMITTEE TO ELECT - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KIRK, CINDY FRIENDS - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KLEIN PAUL - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KLEIN PAUL FRIENDS OF - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KME, COMM. TO ELECT - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KOBISTEK, JACK - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KOBISTEK, JACK FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KOBISTEK, JACK FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 24 HOUR REPORT - 2023","Campaign Finance Statement - KONIECZKA, DAN - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KONIECZKA, DAN FRIENDS OF 4DJ - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KOSTELNIK &amp; MUNSIE, COMM TO ELECT - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KRAUS BRUCE - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KRAUS BRUCE FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - KRUK, MATEUSZ - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LAMB MICHAEL - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 24 HOR REPORT - 2023","Campaign Finance Statement - LAMB MICHAEL COMM TO ELECT - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - LAZZINI, CHUCK - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LEBO FOR EVERY STUDENT - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LEPORE, MICHAEL - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LEPORE, MIKE FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LEUBA, DARWIN - COUNTY CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LEVDANSKY FOR SUPERVISOR - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LEVDANSKY, DAVID - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LIBBY BLACKBURN - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LINDSAY, BRENDA M. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LITTLE, PHIL - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LITTLE, TEAM - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOHR, HILLARY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOHR, HILLARY COMM. TO ELECT - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOPRETTO, DENNIS J. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOPRETTO, JOE COMMITTEE TO ELECT - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOUIS CURCIO JR. - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOVELACE, KATE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LOVELACE, KATE FRIENDS - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - LYONS, KAREN ALLIES FOR - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MACKEY, ROB FRIENDS OF - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MACKEY, ROB FRIENDS OF - COMMISSIONER - 24 HOUR REPORT - 2023","Campaign Finance Statement - MACKEY, ROBERT - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MADONNA-EMMERLING, KATHLEEN - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARCIE CROW - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARIANO, DARREN G. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARK CHIMEL II - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARKO, FRANK - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARSHALL TOWNSHIP REPUBLICAN ORGANIZATION - N/A - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARSHALL TOWNSHIP REPUBLICAN ORGANIZATION - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MARSHALL TOWNSHIP REPUBLICAN ORGANIZATION - N/A - ANNUAL REPORT - 2023","Campaign Finance Statement - MARTINEZ, JAIME - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MATTHEW MOLS - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MAZZARELLA, JULIANE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCCANDLESS REPUBLICAN COMMITTEE - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCCARTHY, BRENDAN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCCARTHY, BRENDAN FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCCLELLAND, ERIN COMMITTEE TO ELECT - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCCLELLAND, ERIN COMMITTEE TO ELECT - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCDERMOTT, DENNIS - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCDERMOTT, DENNIS FRIENDS OF - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCGREGOR, DARREN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCKEES ROCKS FIRST - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCKEESPORT DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCKELLAR, COMMITTEE TO ELECT - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MCKELLAR, WILLIAM A. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MEANS, SUE COMM TO ELECT - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MEANS, SUE COMM TO ELECT - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MEHALIK, MATTHEW M. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MERLINO, DANA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MICHAEL D. POHL - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MICHAEL J. COLBERG - MAGISTERIAL DISTRICT JUDGE - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MIKE POHL FOR FOX CHAPEL - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MIKE WENIGER - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MILLER, LESLIE M. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MODRAK JAMES H - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MOMS FOR GATEWAY - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MONROEVILLE REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MOON DEM COMMITTEE - N/A - 5 - 2ND FRIDAY PRE-ELECTION - 2023","Campaign Finance Statement - MOON REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MORRISSETTE, PHILIIP R. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MOSLEY, KHARI - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - MOSLEY, KHARI FRIENDS OF - MEMBER OF COUNTY COUNCIL - 24 HOR REPORT - 2023","Campaign Finance Statement - MT LEBANON DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MT LEBANON REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MULLIN 4 COMMISSIONER - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - MULLIN, PAT - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - NEWMAN, JUSTIN S. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - NICHOLAS GEANOPULOS - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - NICHOLAS GEANOPULOS - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - NICHOLAS J RUDOLPH - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - O&#39;KEEFE, JESSICA - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - O&#39;KEEFE, JESSICA FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - OAKMONT CANDIDATES 4 U - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - OAKMONT REPUBLICAN COMMITTEE - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - OBERST STEVEN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - OCONNOR  COREY - COUNTY CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - OCONNOR COREY FRIENDS OF - COUNTY CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ONWARD PA - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ORAVECZ, LEIGH ANN - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ORMAY, DEBORAH L. - MEMBER OF COUNCIL - 2ND FRIDAY PRE-ELECTION - 2023","Campaign Finance Statement - PALLONE, MELANIE FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PALMIERE JOHN F. - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PALMIERE, PEOPLE FOR - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PAM HARBIN - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PARADISE, NICK - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PARAVATI, JOHN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PARIS, ANTONIO - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PARIS, JENNIFER - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PARKER, WILLIAM - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PAULAT, JENNA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PAVLECIC, JASON - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PECORA, FRANK - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PECORA, FRANK FRIENDS OF - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PENN HILLS DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PEOPLE TO ELECT QIANA BUCKNER - MAYOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PEOPLE TO ELECT QIANA BUCKNER - MAYOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PHILPOTT, DEANNA FRIENDS OF - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PHLPOTT, DEANNA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PINE REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PINE, FRIENDS FOR A FUTURE - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PINE-RICHLAND KIDS FIRST - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PLEASANT HILLS REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PLOTNICK, ZEBULON E. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PLUM BOROUGH REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PLUM SCHOOLS PAC, FRIENDS OF - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - POSTUFKA, TIM - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - PRIME AE GROUP FEDERAL PAC - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - QIANA BUCKNER - MAYOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - QIANA BUCKNER - MAYOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - QUAKER VALLEY REGION GOP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - QUAKER VALLEY REGION GOP COMM - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - QV TAXPAYERS FOR STRONG SCHOOLS - N/A - 24 HOUR REPORT - 2023","Campaign Finance Statement - QV TAXPAYERS FOR STRONG SCHOOLS - N/A - 24 HOUR REPORT - 2023","Campaign Finance Statement - QV TAXPAYERS FOR STRONG SCHOOLS - N/A - 24 HOUR REPORT - 2023","Campaign Finance Statement - QV TAXPAYERS FOR STRONG SCHOOLS - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RACHAEL FOR CITY CONTROLLER - CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RACHAEL FOR CITY CONTROLLER - CONTROLLER - 24 HOUR REPORT - 2023","Campaign Finance Statement - RACHEL ROSNICK - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RAMBO, ELLIOT - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RAPUK, SAMANTHA - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RASZEWSKI, RICHARD - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - REEVES, WILLIAM PAIL FERRAN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - REGIONAL LEADERS - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RESULTS STILL MATTER USC - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RICCIARDI, NINA - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RICCIARDI, NINA FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - RICHARDSON, RENEE&#39; - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROBERTS, PHILIP - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROBERTS, PHILIP FOR MAGISTERIAL DISTRICT JUDGE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROBINSON BILL COMM TO ELECT - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROBINSON DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROCKEY, JOE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 24 HOUR REPORT - 2023","Campaign Finance Statement - ROCKEY, JOE FRIENDS OF - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROCKEY, JOSEPH - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROGER JERARD POGODA - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROPPA KATHLEEN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROSNICK, RACHEL NEIGHBORS FOR - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROSSELLI, GIUSEPPE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROSSELLI, GIUSEPPE FRIENDS OF - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROYSTON, TRACY - CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROYSTON, TRACY FRIENDS OF - CONTROLLER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ROYSTON, TRACY FRIENDS OF - CONTROLLER - 24 HOUR REPORT - 2023","Campaign Finance Statement - RYAN SCHNEIDERLOCHNER - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SAINOVICH, KRISTIN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SAMANTHA ELLWOOD - SCHOOL DIRECTOR - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SANDERS, CORRY - MAYOR - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SANDERS, CORRY - MAYOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SARNO, AMY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SARNO, AMY FRIENDS OF - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SAXON-KMETZ, COLETTE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SCALES, WELDIANNE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SCALES, WELDIANNE COMM TO ELECT MAGISTRATE JUDGE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SCALZO, VINCENT - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SCHMITT, DIANE - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SCHRIVER JIM - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SCOTT TOWNSHIP REPUBLICAN COMMITTEE - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SEMLER, JESSICA - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SEMLER, JESSICA FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SEROPIAN, DAVID M. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SEYBERT, BRYAN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SHAH, ANISHA - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SHALER DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SHALER REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SHALER, DEMOCRATS FOR - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SIEGLER, JEFF - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SIEGLER, JEFF FOR MT LEBANON - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SILVEY, NORA M. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SIMMONS, SARAH - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SMITH, TARA COMMITTEE TO REELECT - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SMITH, TARA L. - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SPADE, HELEN D COMMITTEE TO ELECT - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SPADE, HELEN D. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SPRATT, ERIK - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SPRINGER, MARK - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - STRASSBURGER, ERIKA - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - STRASSBURGER, ERIKA - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - STRASSBURGER, ERIKA FRIENDS - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SUMPTER THOM COMM TO ELECT - SCHOOL DIRECTOR - ANNUAL REPORT - 2023","Campaign Finance Statement - SUSAN H. FISHER - COMMISSIONER - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SWEENEY, MARGARETH - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - SZUMINSKY, CHRISTOPHER - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - THATCHER, FRIENDS OF MIKE - MAGISTERIAL DISTRICT JUDGE - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - THATCHER, FRIENDS OF MIKE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - THATCHER, MICHAEL WILLIAM - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - THOMAS A. BABINSACK - MAGISTERIAL DISTRICT JUDGE - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TO KEEP WHITEHALL COUNCIL - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TOGETHER FOR NA - N/A - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TOGETHER FOR PR - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TRENT, MAUREEN - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TRENT, MAUREEN FRIENDS OF - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TRISTAN LUCCHETTI - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TROY, DENNIS FRIENDS - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TROY, DENNIS H. - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TUNNEY, GEORGE D. - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - TUNNEY, GEORGE D. - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - UPPER ST CLAIR DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - UPPER ST CLAIR REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VACCARELLO, ANTHONY - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VALENT, RICHARD - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VALENT, RICHARD FRIENDS OF - SUPERVISOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VERDETTO III, LEONARD - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VERDETTO III, LEONARD FRIENDS OF - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VERONA REP COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VERONA REP COMM - N/A - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - VIOLA GARIS - MEMBER OF COUNCIL - 2 - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WALSH, KIMBERLY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WALTON FOR AC COUNCIL - MEMBER OF COUNTY COUNCIL - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WALTON FOR AC COUNCIL - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WALTON, DEWITT - MEMBER OF COUNTY COUNCIL - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WALTON, DEWITT - MEMBER OF COUNTY COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WAMPLER, TIFFANY - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WARNER, ELIZABETH - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WAYNE, RYAN MATTHEW D. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WEATHERBY JEFFREY W. - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WEBB, AMBER - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WEINSTEIN JOHN - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WEINSTEIN JOHN FRIENDS OF - COUNTY CHIEF EXECUTIVE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WERMAGER, SETH - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WERTS, DAMIAN J. - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WHITE, DAVID - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WHITEHALL DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WHITEHALL REP. EXEC. COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WIETHORN, MIKE - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILKINSBURG ACTION COMMITTEE - N/A - 1 - 6TH TUESDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILKINSBURG ACTION COMMITTEE - N/A - 2 - 2ND FRIDAY PRE-PRIMARY` - 2023","Campaign Finance Statement - WILKINSBURG DEM COMM - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILKINSBURG UNITED - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILLIAMS, BROOKE PEOPLE FOR - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILSON BOBBY - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILSON BOBBY FRIENDS - MEMBER OF COUNCIL - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WILSON BOBBY FRIENDS - MEMBER OF COUNCIL - 24 HOUR REPORT - 2023","Campaign Finance Statement - WILSON, ANNE SWAGER FRIENDS OF - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WJHSD - STUDENTS COMMUNITY PRIDE - N/A - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - WYLAND, JACOB - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ZALETSKI, KELLY ANN - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ZAPPALA JR STEPHEN FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - ZAPPALA JR STEPHEN FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - ZAPPALA JR STEPHEN FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - ZAPPALA JR STEPHEN FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - ZAPPALA JR STEPHEN FRIENDS OF - DISTRICT ATTORNEY - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ZAPPALA JR STEPHEN FRIENDS OF - DISTRICT ATTORNEY - 24 HOUR REPORT - 2023","Campaign Finance Statement - ZAPPALA JR. STEPHEN A. - DISTRICT ATTORNEY - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ZIEGER, BOB - SCHOOL DIRECTOR - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ZURISKO, JEFFREY FRIENDS OF FOR DISTRICT JUDGE - MAGISTERIAL DISTRICT JUDGE - 2ND FRIDAY PRE-PRIMARY - 2023","Campaign Finance Statement - ZYMROZ FOR COMMISSIONER - COMMISSIONER - 2ND FRIDAY PRE-PRIMARY - 2023"]